roboter/Hardware/GigaDevice/GD32VF103/GD-Link Programmer/OptionBytesXML/GD32W515.xml
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>DP_0[31:0]</name>
                <brief>Efuse Debug password value</brief>
                <description>Efuse Debug password value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_DP_1</name>
		<displayName>EFUSE_DP_1</displayName>
		<addressOffset>0x50</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>DP_1[31:0]</name>
                <brief>Efuse Debug password value</brief>
                <description>Efuse Debug password value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_0</name>
		<displayName>EFUSE_IAK_GSSA_0</displayName>
		<addressOffset>0x54</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_0[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_1</name>
		<displayName>EFUSE_IAK_GSSA_1</displayName>
		<addressOffset>0x58</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_1[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_2</name>
		<displayName>EFUSE_IAK_GSSA_2</displayName>
		<addressOffset>0x5C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_2[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
    <OPByte>
		<name>EFUSE_IAK_GSSA_3</name>
		<displayName>EFUSE_IAK_GSSA_3</displayName>
		<addressOffset>0x60</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_3[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_4</name>
		<displayName>EFUSE_IAK_GSSA_4</displayName>
		<addressOffset>0x64</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_4[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_5</name>
		<displayName>EFUSE_IAK_GSSA_5</displayName>
		<addressOffset>0x68</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_5[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_6</name>
		<displayName>EFUSE_IAK_GSSA_6</displayName>
		<addressOffset>0x6C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_6[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_7</name>
		<displayName>EFUSE_IAK_GSSA_7</displayName>
		<addressOffset>0x70</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_7[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_8</name>
		<displayName>EFUSE_IAK_GSSA_8</displayName>
		<addressOffset>0x74</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_8[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
    <OPByte>
		<name>EFUSE_IAK_GSSA_9</name>
		<displayName>EFUSE_IAK_GSSA_9</displayName>
		<addressOffset>0x78</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_9[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_10</name>
		<displayName>EFUSE_IAK_GSSA_10</displayName>
		<addressOffset>0x7C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_10[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
		<OPByte>
		<name>EFUSE_IAK_GSSA_11</name>
		<displayName>EFUSE_IAK_GSSA_11</displayName>
		<addressOffset>0x80</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_11[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_12</name>
		<displayName>EFUSE_IAK_GSSA_12</displayName>
		<addressOffset>0x84</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_12[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_13</name>
		<displayName>EFUSE_IAK_GSSA_13</displayName>
		<addressOffset>0x88</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_13[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_14</name>
		<displayName>EFUSE_IAK_GSSA_14</displayName>
		<addressOffset>0x8C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_14[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_IAK_GSSA_15</name>
		<displayName>EFUSE_IAK_GSSA_15</displayName>
		<addressOffset>0x90</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>IAKRSS_15[31:0]</name>
                <brief>Efuse IAK/GSSA value</brief>
                <description>The properties of this register depend on the IAKSEL bit in the EFUSE_CS register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_PUID_0</name>
		<displayName>EFUSE_PUID_0</displayName>
		<addressOffset>0x94</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>UID_0[31:0]</name>
                <brief>Efuse MCU UID value</brief>
                <description>Efuse MCU UID value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_PUID_1</name>
		<displayName>EFUSE_PUID_1</displayName>
		<addressOffset>0x98</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>UID_1[31:0]</name>
                <brief>Efuse MCU UID value</brief>
                <description>Efuse MCU UID value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_PUID_2</name>
		<displayName>EFUSE_PUID_2</displayName>
		<addressOffset>0x9C</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>UID_2[31:0]</name>
                <brief>Efuse MCU UID value</brief>
                <description>Efuse MCU UID value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_PUID_3</name>
		<displayName>EFUSE_PUID_3</displayName>
		<addressOffset>0xA0</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>UID_3[31:0]</name>
                <brief>Efuse MCU UID value</brief>
                <description>Efuse MCU UID value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_HUK_KEY_0</name>
		<displayName>EFUSE_HUK_KEY_0</displayName>
		<addressOffset>0xA4</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>HKEY_0[31:0]</name>
                <brief>Efuse HUK value</brief>
                <description>Efuse HUK value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_HUK_KEY_1</name>
		<displayName>EFUSE_HUK_KEY_1</displayName>
		<addressOffset>0xA8</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>HKEY_1[31:0]</name>
                <brief>Efuse HUK value</brief>
                <description>Efuse HUK value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_HUK_KEY_2</name>
		<displayName>EFUSE_HUK_KEY_2</displayName>
		<addressOffset>0xAC</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>HKEY_2[31:0]</name>
                <brief>Efuse HUK value</brief>
                <description>Efuse HUK value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_HUK_KEY_3</name>
		<displayName>EFUSE_HUK_KEY_3</displayName>
		<addressOffset>0xB0</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>HKEY_3[31:0]</name>
                <brief>Efuse HUK value</brief>
                <description>Efuse HUK value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_0</name>
		<displayName>EFUSE_RF_DATA_0</displayName>
		<addressOffset>0xB4</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_0[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_1</name>
		<displayName>EFUSE_RF_DATA_1</displayName>
		<addressOffset>0xB8</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_1[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_2</name>
		<displayName>EFUSE_RF_DATA_2</displayName>
		<addressOffset>0xBC</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_2[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_3</name>
		<displayName>EFUSE_RF_DATA_3</displayName>
		<addressOffset>0xC0</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_3[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_4</name>
		<displayName>EFUSE_RF_DATA_4</displayName>
		<addressOffset>0xC4</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_4[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_5</name>
		<displayName>EFUSE_RF_DATA_5</displayName>
		<addressOffset>0xC8</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_5[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_6</name>
		<displayName>EFUSE_RF_DATA_6</displayName>
		<addressOffset>0xCC</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_6[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_7</name>
		<displayName>EFUSE_RF_DATA_7</displayName>
		<addressOffset>0xD0</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_7[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_8</name>
		<displayName>EFUSE_RF_DATA_8</displayName>
		<addressOffset>0xD4</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_8[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_9</name>
		<displayName>EFUSE_RF_DATA_9</displayName>
		<addressOffset>0xD8</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_9[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_10</name>
		<displayName>EFUSE_RF_DATA_10</displayName>
		<addressOffset>0xDC</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_10[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_RF_DATA_11</name>
		<displayName>EFUSE_RF_DATA_11</displayName>
		<addressOffset>0xE0</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>RFDATA_11[31:0]</name>
                <brief>Efuse RF data value</brief>
                <description>Efuse RF data value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_0</name>
		<displayName>EFUSE_USER_data_0</displayName>
		<addressOffset>0xE4</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_0[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_1</name>
		<displayName>EFUSE_USER_data_1</displayName>
		<addressOffset>0xE8</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_1[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_2</name>
		<displayName>EFUSE_USER_data_2</displayName>
		<addressOffset>0xEC</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_2[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_3</name>
		<displayName>EFUSE_USER_data_3</displayName>
		<addressOffset>0xF0</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_3[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_4</name>
		<displayName>EFUSE_USER_data_4</displayName>
		<addressOffset>0xF4</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_4[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_5</name>
		<displayName>EFUSE_USER_data_5</displayName>
		<addressOffset>0xF8</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_5[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_6</name>
		<displayName>EFUSE_USER_data_6</displayName>
		<addressOffset>0xFC</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_6[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
	<OPByte>
		<name>EFUSE_USER_data_7</name>
		<displayName>EFUSE_USER_data_7</displayName>
		<addressOffset>0x100</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<complement>FFFF</complement>
		<fields>
			<field>
                <name>USERDATA_7[31:0]</name>
                <brief>Efuse USER_DATA value</brief>
                <description>Efuse USER_DATA value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
            </field>
		</fields>
    </OPByte>
</OPBytes>